app/controllers/api/categories_controller.rb

    def index
        @categories = Category.all()
---
SELECT "categories".* FROM "categories"

    def show
        @category = Category.find_by(id: params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]