app/controllers/api/clips_controller.rb

SELECT "clips".* FROM "clips"
---
    def index
        @clips = Clip.all()

SELECT  "clips".* FROM "clips" WHERE "clips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @clip = Clip.find_by(id: params[:id])

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "clips" ("user_id", "category", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 11], ["category", ""], ["title", "Party at the tree"], ["created_at", "2020-12-13 01:51:15.860942"], ["updated_at", "2020-12-13 01:51:15.860942"]]
---
    def create
        @clip = Clip.new(clip_params)
        @clip.user_id = User.first.id
        # remove this later ^

        if @clip.save